Revit 2024 API
BuiltInFailures.CurtainWallFailures.MustReplacePanels Property
 Missing Curtain Panels will be replaced with System Panels to complete command.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId MustReplacePanels { get; }
Visual Basic
Public Shared ReadOnly Property MustReplacePanels As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ MustReplacePanels {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CurtainWallFailures Class
Autodesk.Revit.DB Namespace